-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: schooldb
-- ------------------------------------------------------
-- Server version	8.0.37

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `st_no` varchar(50) NOT NULL,
  `st_name` varchar(50) DEFAULT NULL,
  `st_birth` varchar(50) DEFAULT NULL,
  `st_gender` varchar(10) DEFAULT NULL,
  `st_addr` varchar(50) DEFAULT NULL,
  `st_phone` varchar(50) DEFAULT NULL,
  `st_parent_phone` varchar(50) DEFAULT NULL,
  `st_grade` varchar(50) DEFAULT NULL,
  `tc_no` varchar(50) DEFAULT NULL,
  `st_status` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`st_no`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES ('st001','김자바','2010-11-08','여자','대전광역시 서구 둔산동 290','010-5323-0454','010-6299-0137','3학년','tc003','재학'),('st002','이자바','2010-09-02','남자','대전광역시 서구 둔산동 232','010-4613-9232','010-2320-3905','3학년','tc003','재학'),('st003','박자바','2010-10-18','여자','대전광역시 서구 둔산동 093','010-5917-9050','010-7499-0343','3학년','tc003','재학'),('st004','조자바','2010-10-10','남자','대전광역시 서구 둔산동 877','010-5922-0228','010-3373-6182','3학년','tc003','재학'),('st005','최자바','2010-06-21','남자','대전광역시 서구 둔산동 833','010-9219-9494','010-9814-0590','3학년','tc003','재학'),('st006','오자바','2010-10-13','여자','대전광역시 서구 둔산동 333','010-6458-3017','010-3149-6695','3학년','tc003','재학'),('st007','진자바','2010-10-03','여자','대전광역시 서구 둔산동 759','010-3179-8697','010-3949-3656','3학년','tc003','재학'),('st008','곽자바','2010-09-28','여자','대전광역시 서구 둔산동 103','010-6224-3673','010-9693-7447','3학년','tc003','재학'),('st009','김디비','2010-10-10','남자','대전광역시 서구 둔산동 131','010-6363-2096','010-1392-0671','3학년','tc003','재학'),('st010','이디비','2010-03-23','남자','대전광역시 서구 둔산동 032','010-4316-0844','010-1274-3838','3학년','tc003','재학'),('st011','박디비','2011-01-19','남자','대전광역시 서구 둔산동 532','010-7916-4909','010-8011-9275','2학년','tc002','재학'),('st012','조디비','2011-10-16','남자','대전광역시 서구 둔산동 715','010-5520-0439','010-5636-6862','2학년','tc002','재학'),('st013','최디비','2011-12-02','남자','대전광역시 서구 둔산동 621','010-3931-0170','010-9058-4780','2학년','tc002','휴학'),('st014','오디비','2011-08-11','여자','대전광역시 서구 둔산동 983','010-5233-8498','010-6793-8470','2학년','tc002','재학'),('st015','진디비','2011-08-24','남자','대전광역시 서구 둔산동 435','010-8212-3141','010-1068-5917','2학년','tc002','재학'),('st016','곽디비','2011-02-17','남자','대전광역시 서구 둔산동 112','010-3073-3051','010-6035-1024','2학년','tc002','재학'),('st017','김학생','2011-11-25','여자','대전광역시 서구 둔산동 384','010-9116-4281','010-4056-7437','2학년','tc002','재학'),('st018','이학생','2011-11-17','남자','대전광역시 서구 둔산동 862','010-9766-8091','010-1157-1513','2학년','tc002','재학'),('st019','휴학생','2011-09-26','남자','대전광역시 서구 둔산동 657','010-2524-0433','010-4594-1672','2학년','tc002','휴학'),('st020','박학생','2011-07-13','여자','대전광역시 서구 둔산동 629','010-5579-0358','010-5056-4205','2학년','tc002','재학'),('st021','조학생','2012-08-26','여자','대전광역시 서구 둔산동 739','010-3138-1392','010-7547-3559','1학년','tc001','재학'),('st022','최학생','2012-12-14','남자','대전광역시 서구 둔산동 581','010-3038-4950','010-5639-3346','1학년','tc001','휴학'),('st023','오학생','2012-07-04','여자','대전광역시 서구 둔산동 538','010-2752-5842','010-9578-7260','1학년','tc001','재학'),('st024','진학생','2012-08-19','남자','대전광역시 서구 둔산동 149','010-5372-7927','010-3521-3822','1학년','tc001','재학'),('st025','곽학생','2012-01-28','여자','대전광역시 서구 둔산동 109','010-3623-8412','010-1191-0721','1학년','tc001','재학'),('st026','가도하','2012-12-16','여자','대전광역시 서구 둔산동 708','010-2692-9927','010-1562-8030','1학년','tc001','재학'),('st027','가승우','2012-12-25','여자','대전광역시 서구 둔산동 777','010-2653-5133','010-4873-8964','1학년','tc001','재학'),('st028','가예준','2012-12-22','여자','대전광역시 서구 둔산동 111','010-5874-6308','010-3917-0662','1학년','tc001','재학'),('st029','곽민재','2012-06-13','여자','대전광역시 서구 둔산동 222','010-7526-7447','010-4978-2552','1학년','tc001','재학'),('st030','스프링','2012-05-14','남자','대전광역시 서구 둔산동 406','010-9267-8019','010-2293-7410','1학년','tc001','재학');
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-06-26 17:04:19
